import React from "react";
import {Stack, Typography} from "@mui/material";
import {BlurStack} from "@/ui/Containers/Stack";

export const Forecast = () => {
    return(
        <Stack
            width={'50%'}
            spacing={1}
        >
            <Typography fontSize={24} fontWeight={700} color={'#FFFFFF'} textAlign={'center'}>
                Прогноз на тиждень
            </Typography>
            <BlurStack
                className={'custom-slider'}
                padding={'2%'}
                style={{
                    overflowY: 'auto',
                    border: '2px solid rgba(217, 217, 217, 0.4)',
                    boxShadow: 'inset 0 2px 5px rgba(0, 0, 0, 0.3), ' +
                        'inset 0 -2px 5px rgba(0, 0, 0, 0.3)',
                }}
            >
                <Typography fontSize={16} fontWeight={400} color={'#FFFFFF'} textAlign={'justify'}>
                    Понеділок:
                    Цей день почнеться з енергійного старту. У вас буде багато сил для виконання всіх запланованих справ. Можливо, вам доведеться займатися кількома завданнями одночасно, але ви зможете впоратися завдяки своїй організованості.
                    Вівторок:
                    На вас чекає приємна зустріч із друзями або близькими людьми. Цей день буде сприятливим для встановлення нових контактів та відновлення старих зв`язків. Ваша харизма і впевненість притягуватимуть людей до вас.

                    Середа:
                    Цього дня вам може здатися, що справи йдуть не так, як планувалося. Проте не варто впадати у відчай. Використайте цей час для аналізу та переосмислення своїх дій. Вечір буде сприятливим для відпочинку і релаксації.

                    Четвер:
                    Ваша працездатність і рішучість принесуть свої плоди. Цього дня ви можете досягти значних успіхів у професійній сфері. Будьте готові до несподіваних пропозицій і нових можливостей.

                    П`ятниця:
                    Цей день обіцяє бути спокійним і гармонійним. Ви зможете завершити всі заплановані справи і знайти час для себе. Вечір буде сприятливим для занять хобі або проведення часу з близькими людьми.

                    Субота:
                    Цього дня вам слід приділити увагу своєму здоров`ю. Займіться спортом, відвідайте тренажерний зал або просто прогуляйтеся на свіжому повітрі. Також не забудьте про правильне харчування.

                    Неділя:
                    Цей день буде сприятливим для відпочинку та релаксації. Проведіть час на природі або займіться улюбленими справами. Ваша енергія буде на високому рівні, що дозволить вам зарядитися позитивними емоціями на весь наступний тиждень.

                    Порада на тиждень:
                    Не забувайте про важливість планування та організації. Складіть список справ і дотримуйтеся його, щоб ефективно розподілити свій час і ресурси. Пам`ятайте, що успіх залежить від вашої рішучості та вміння адаптуватися до обставин.
                </Typography>
            </BlurStack>
        </Stack>
    )
}
